<?php

$data = [];
/*
 * ========================================================================================
 * Дом 1
 */
$house = [
	"name" => "Коттедж 1",
	"image" => "коттедж(4)_1.jpg",
	"icon" => "коттедж(4)_1.jpg",
	"config"=>["margin-top"=>"-100px"],
	"images_folder" => "images/house/h1/",
	"elements" => [
		[
			"name" => "Цвет облицовочного кирпича",
			"icon" => "", 
			"value" => [
				["name" => "серый", "image" => "Кирпич коричневый2.png","icon"=>"#8b7c7b"],
				["name" => "красный (терракот)", "image" => "Кирпич красный2.png","icon"=>"#fb8e4f"],
				["name" => "солома", "image" => "Кирпич солома2.png","icon"=>"#cba560"],
			]
			],
			
			/*
			[
			"name" => "Цвет пояса",
			"icon" => "", 
			"value" => [
				["name" => " серый", "image" => "Пояс коричневый.png","icon"=>"#8b7c7b"],
				["name" => " красный", "image" => "пояс красный.png","icon"=>"#fb8e4f"],
				["name" => " солома", "image" => "Пояс солома.png","icon"=>"#c6a15a"],
			]
		],
		*/
		[
			"name" => "Цвет цоколя",
			"icon" => "", 
			"value" => [
				["name" => " белый", "image" => "цоколь белый.png","icon"=>"#fff"],
				["name" => " бежевый", "image" => "цоколь коричневый.png","icon"=>"#dbbd80"],
				["name" => " светло-серый", "image" => "цоколь серый.png","icon"=>"#d2c4aa"],
			]
		],
		
		[
			"name" => "Цвет крыши",
			"icon" => "", 
			"value" => [
				["name" => " зеленый RAL 6005", "image" => "крыша зеленая.png"  ,"icon"=>"крыша зеленая icon.png"],
				["name" => " коричневый RAL 8017", "image" => "крыша коричневая.png" ,"icon"=>"крыша коричневая icon.png"],
				["name" => " красный RAL 3005", "image" => "крыша красная.png" ,"icon"=>"крыша красная icon.png"],
				["name" => " терракотовый RAL 8004", "image" => "крыша терракот 2.png" ,"icon"=>"крыша терракот icon(1).png"],
				["name" => " синий RAL 5010", "image" => "крыша синяя.png" ,"icon"=>"крыша синяя icon.png"],
			]
		],
		
		
			[
			"name" => "Цвет водостока",
			"icon" => "", 
			"value" => [
				["name" => "белый RAL 9003", "image" => "Водосток белый.png","icon"=>"#fff"],
				["name" => "коричневый RAL 8017", "image" => "Водосток коричневый2.png","icon"=>"#492e3d"],
				["name" => "красный RAL 3005", "image" => "Водосток красный.png","icon"=>"#9b3d51"],
				["name" => "Зеленый RAL 6005", "image" => "Водосток зеленый.png","icon"=>"#19643d"],
				
			]
		],
		[
			"name" => "Цвет подшивки",
			"icon" => "", 
			"value" => [
				["name" => " белый RAL 9003", "image" => "подшивка белая.png","icon"=>"#fff"],
				["name" => " коричневый RAL 8017", "image" => "подшивка коричневая.png","icon"=>"#492e3d"],
			]
		],
		[
			"name" => "Цвет окон",
			"icon" => "", 
			"value" => [
				["name" => "белый RAL 9003", "image" => "Окна белые.png","icon"=>"#fff"],
				["name" => "коричневый RAL 8017", "image" => "Окна коричневые(1).png","icon"=>"#492e3d"],
				["name" => "георгин RAL 1033", "image" => "Окна сосна.png","icon"=>"#f4be61"],
			]
		],
		
	
		
	
		
		
		
		
		
		[
			"name" => "Цвет тротуара",
			"icon" => "", 
			"value" => [
				["name" => " светло-серый", "image" => "тротуар светло серый.png","icon"=>"#c6c5c1"],
				["name" => " темно-серый", "image" => "тротуар темно серый.png","icon"=>"#74726f"],
				["name" => " красный", "image" => "тротуар темно терракотовый.png","icon"=>"#a05e5c"],
			]
		],
		
		
		
	],
];
$data[] = $house;
/*
 * =========================================================================================================
 */



/*
 * ========================================================================================
 * Дом 2
 */
$house = [
	"name" => "Коттедж 2",
	"image" => "коттедж2_1.jpg",
	"icon" => "коттедж2_1.jpg",
	"images_folder" => "images/house/h1/",
	"elements" => [
		[
			"name" => "Материал стен",
			"icon" => "", 
			"value" => [
				["name" => "Кирпич коричневый", "image" => "Кирпич коричневый.png","icon"=>"#8b7c7b"],
				["name" => "Кирпич красный", "image" => "Кирпич красный.png","icon"=>"#fb8e4f"],
				["name" => "Кирпич солома", "image" => "Кирпич солома.png","icon"=>"#cba560"],
			]
		],
		
		[
			"name" => "Цвет окон",
			"icon" => "", 
			"value" => [
				["name" => "Окна белые", "image" => "Окна белые.png","icon"=>"#fff"],
				["name" => "Окна коричневые", "image" => "Окна коричневые.png","icon"=>"#8b7c7b"],
				["name" => "Окна сосна", "image" => "Окна сосна.png","icon"=>"#f4be61"],
			]
		],
		
		
		
	],
];
$data[] = $house;
/*
 * =========================================================================================================
 */

